Repository: CofficLab/GitOK
Catalog: Packages/ProviderConversation/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Chat
zh_hans: 对话
zh_hk: 對話

source: Build
zh_hans: 构建
zh_hk: 構建

source: Autonomous
zh_hans: 自主
zh_hk: 自主

source: Conversation only, no tools executed
zh_hans: 只进行对话，不执行任何工具
zh_hk: 只進行對話，不執行任何工具

source: Can execute tools, high-risk actions require confirmation
zh_hans: 可以执行工具，高风险需要确认
zh_hk: 可以執行工具，高風險需要確認

source: Can autonomously execute tools and keep progressing
zh_hans: 可以自主执行工具，持续推进任务
zh_hk: 可以自主執行工具，持續推進任務

source: Chinese
zh_hans: 中文
zh_hk: 中文

source: ZH
zh_hans: 中
zh_hk: 中

source: English
zh_hans: 英语
zh_hk: 英語

source: Low
zh_hans: 低
zh_hk: 低

source: Medium
zh_hans: 中
zh_hk: 中

source: High
zh_hans: 高
zh_hk: 高

source: Very High
zh_hans: 超高
zh_hk: 超高

source: Maximum
zh_hans: 极限
zh_hk: 極限

source: Lightweight reasoning, best for simple Q&A
zh_hans: 轻量推理，适合简单问答
zh_hk: 輕量推理，適合簡單問答

source: Standard reasoning, best for general tasks
zh_hans: 标准推理，适合一般任务
zh_hk: 標準推理，適合一般任務

source: Deep reasoning, best for complex code and architecture
zh_hans: 深度推理，适合复杂代码和架构
zh_hk: 深度推理，適合複雜程式碼和架構

source: Higher reasoning budget for hard problems
zh_hans: 更高推理预算，适合硬骨头
zh_hk: 更高推理預算，適合難題

source: Maximum reasoning budget for extreme debugging
zh_hans: 最大推理预算，适合极致调试和难题
zh_hk: 最大推理預算，適合極致除錯和難題

source: Brief
zh_hans: 简洁
zh_hk: 簡潔

source: Detailed
zh_hans: 详细
zh_hk: 詳細

source: Return only core conclusions
zh_hans: 只返回核心结论
zh_hk: 只返回核心結論

source: Include necessary explanations and steps
zh_hans: 包含必要说明和步骤
zh_hk: 包含必要說明和步驟

source: Include full reasoning and context
zh_hans: 包含完整推理和上下文
zh_hk: 包含完整推理和上下文

source: Standard
zh_hans: 标准
zh_hk: 標準
